"""
от pluck - щипать, выщипывать
Вам задан массив A длины n, состоящий из цифр. Вы можете применять следующую операцию :
Выбираете две различные цифры в массиве A[i] и A[j] и удаляете их из массива.
Каким может быть минимальный размер массива после применения к нему некоторой последовательности операций?
inputFormat: Первая строка содержит одно целое число n (1≤n≤2⋅10^5) — длина массива A.
outputFormat: Вторая строка содержит n цифр массива A
Выведите одно целое число – минимальный возможный размер массива после применения к нему некоторой последовательности операций.
Sample Input:
6
1 6 1 1 4 4
Sample Output: 0
"""